// Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, может ли ладья попасть с первой клетки на вторую одним ходом.

#include <iostream>
using namespace std;
int main() {
  int a, b, a1, b1;
  cin >> a >> b >> a1 >> b1;
  if ((a1 == a + 1 && b1 == b) || (b1 == b + 1 && a1 == a) || (a1 == a - 1 && b1 == b) || (b1 == b - 1 && a1 == a) || (a1 == a + 1 && b1 == b + 1) || (a1 == a + 1 && b1 == b - 1) || (a1 == a - 1 && b1 == b + 1) || (a1 == a - 1 && b1 == b - 1)) {
    cout << "YES";
    } else {
    cout << "NO";
    }
  return 0;
}
